**`commonimages/base/windows_2012_r2_SQL_2014`** terragrunt plan on `push` event [#399](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 3s
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this must be replaced
-/+ resource "aws_imagebuilder_distribution_configuration" "this" {
      ~ arn          = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/base-windows-server-2012-r2-sql-2014-standard" -> (known after apply)
      ~ date_created = "2023-10-09T14:06:58.971Z" -> (known after apply)
      + date_updated = (known after apply)
      ~ description  = "Windows Server 2012 R2 with SQL 2014 Standard" -> "Windows Server 2012 R2 with SQL 2014 Enterprise"
      ~ id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/base-windows-server-2012-r2-sql-2014-standard" -> (known after apply)
      ~ name         = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise" # forces replacement
      ~ tags         = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "n/a"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
          ~ "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise"
          ~ "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
            "is-production"                           = "true"
          ~ "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard" -> "windows server 2012 r2 with SQL 2014 Enterprise"
            "release-or-patch"                        = "release"
          ~ "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard" -> "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_enterprise"
        }
      ~ tags_all     = {
          ~ "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise"
          ~ "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard" -> "windows server 2012 r2 with SQL 2014 Enterprise"
          ~ "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard" -> "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_enterprise"
            # (6 unchanged elements hidden)
        }

      - distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-windows-server-2012-r2-sql-2014-standard" -> (known after apply)
      ~ date_created                     = "2023-10-09T14:07:00.742Z" -> (known after apply)
      + date_last_run                    = (known after apply)
      ~ date_next_run                    = "2023-11-01T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-10-09T14:07:00.742Z" -> (known after apply)
      ~ description                      = "Windows Server 2012 R2 with SQL 2014 Standard" -> "Windows Server 2012 R2 with SQL 2014 Enterprise"
      ~ distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/base-windows-server-2012-r2-sql-2014-standard" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-windows-server-2012-r2-sql-2014-standard" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-windows-server-2012-r2-sql-2014-standard/0.0.1" # forces replacement -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-windows-server-2012-r2-sql-2014-standard-0-0-1" -> (known after apply)
      ~ name                             = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise" # forces replacement
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "n/a"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
          ~ "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise"
          ~ "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
            "is-production"                           = "true"
          ~ "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard" -> "windows server 2012 r2 with SQL 2014 Enterprise"
            "release-or-patch"                        = "release"
          ~ "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard" -> "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_enterprise"
        }
      ~ tags_all                         = {
          ~ "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise"
          ~ "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard" -> "windows server 2012 r2 with SQL 2014 Enterprise"
          ~ "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard" -> "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_enterprise"
            # (6 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-windows-server-2012-r2-sql-2014-standard/0.0.1" -> (known after apply)
      ~ date_created     = "2023-10-09T14:06:59.694Z" -> (known after apply)
      ~ description      = "Windows Server 2012 R2 with SQL 2014 Standard" -> "Windows Server 2012 R2 with SQL 2014 Enterprise" # forces replacement
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-windows-server-2012-r2-sql-2014-standard/0.0.1" -> (known after apply)
      ~ name             = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise" # forces replacement
      ~ owner            = "374269020027" -> (known after apply)
      ~ parent_image     = "ami-041565876be3c11cf" -> "ami-04acd846840e5b2a2" # forces replacement
      ~ platform         = "Windows" -> (known after apply)
      ~ tags             = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "n/a"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
          ~ "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise"
          ~ "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
            "is-production"                           = "true"
          ~ "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard" -> "windows server 2012 r2 with SQL 2014 Enterprise"
            "release-or-patch"                        = "release"
          ~ "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard" -> "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_enterprise"
        }
      ~ tags_all         = {
          ~ "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise"
          ~ "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard" -> "windows server 2012 r2 with SQL 2014 Enterprise"
          ~ "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard" -> "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_enterprise"
            # (6 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.1" -> "0.0.2" # forces replacement

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 128 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdb" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 128
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-windows-server-2012-r2-sql-2014-standard-0-0-1" -> (known after apply)
      ~ date_created                  = "2023-10-09T14:06:59.428Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ description                   = "Windows Server 2012 R2 with SQL 2014 Standard" -> "Windows Server 2012 R2 with SQL 2014 Enterprise"
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-windows-server-2012-r2-sql-2014-standard-0-0-1" -> (known after apply)
      ~ name                          = "base_windows_server_2012_r2_SQL_2014_standard_0_0_1" -> "base_windows_server_2012_r2_SQL_2014_enterprise_0_0_2" # forces replacement
      ~ resource_tags                 = {
          ~ "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise"
          ~ "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard" -> "windows server 2012 r2 with SQL 2014 Enterprise"
          ~ "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard" -> "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_enterprise"
            # (6 unchanged elements hidden)
        }
      ~ tags                          = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "n/a"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
          ~ "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise"
          ~ "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
            "is-production"                           = "true"
          ~ "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard" -> "windows server 2012 r2 with SQL 2014 Enterprise"
            "release-or-patch"                        = "release"
          ~ "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard" -> "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_enterprise"
        }
      ~ tags_all                      = {
          ~ "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard" -> "base_windows_server_2012_r2_SQL_2014_enterprise"
          ~ "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1" -> "base_windows_server_2012_r2_SQL_2014_enterprise/0.0.2"
          ~ "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard" -> "windows server 2012 r2 with SQL 2014 Enterprise"
          ~ "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard" -> "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_enterprise"
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

```
